app/Controllers/Home.php

SELECT *
FROM `productos`
---
    public function index()
    {
        //Obtener todos los productos desde el modelo
$productos = $this->productosModel->findAll();