app/Controllers/Productos.php

SELECT *
FROM `productos`
WHERE `productos`.`id` = '1'
---
    public function view($id)
    {
        // Obtener el producto específico por ID
        $producto = $this->productosModel->find($id);